In [1]:
import pandas as pd

In [2]:
df_notas = pd.DataFrame({
    "Nome": ["Diana", "Clark", "Bruce", "Bruce"],
    "Port":[9, 7, 8, 9],
    "Mat":[7, 5, 9, 8],
    "Bio":[5, 5, 8, 7]
})
df_notas

    Nome  Port  Mat  Bio
0  Diana     9    7    5
1  Clark     7    5    5
2  Bruce     8    9    8
3  Bruce     9    8    7

In [3]:
# Intervalo
df_notas.loc[0:1]

    Nome  Port  Mat  Bio
0  Diana     9    7    5
1  Clark     7    5    5

In [4]:
# Localiza por nome
df_notas.loc[df_notas["Nome"] == "Bruce"]

    Nome  Port  Mat  Bio
2  Bruce     8    9    8
3  Bruce     9    8    7

In [5]:
# Localiza por nome e limita colunas de exibição
df_notas.loc[df_notas["Nome"] == "Bruce", ["Nome", "Bio"]]

    Nome  Bio
2  Bruce    8
3  Bruce    7

In [6]:
# Cria novo DF com as colunas na ordem escolhida
df_notas_bruce = df_notas.loc[df_notas["Nome"] == "Bruce", ["Nome", "Mat", "Port"]]
df_notas_bruce

    Nome  Mat  Port
2  Bruce    9     8
3  Bruce    8     9

#### Resume DF sem loc

In [7]:
df_resume = df_notas[["Nome", "Port", "Mat"]]
df_resume

    Nome  Port  Mat
0  Diana     9    7
1  Clark     7    5
2  Bruce     8    9
3  Bruce     9    8